/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package verbroot;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileNotFoundException;
import java.io.FileReader;
import java.io.IOException;
import java.time.LocalTime;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;
import java.util.logging.Level;
import java.util.logging.Logger;

public class Margin {

    String path = "./resources/Verbs02.database";
    private List<String> Lines;

    public List<String> getAllLines() {

        try {
            List<String> lines = new ArrayList();

            File file = new File(path);
            FileReader fr = null;
            try {
                fr = new FileReader(file);
            } catch (FileNotFoundException ex) {
                Logger.getLogger(Dictionary.class.getName()).log(Level.SEVERE, null, ex);
            }
            BufferedReader bfr = new BufferedReader(fr);
            String line;
            int i = 0;
            while ((line = bfr.readLine()) != null) {
                lines.add(line);
//                Linesdediac.add(uts.deDiacritic(line));
            }
            Lines = lines;
            return lines;
        } catch (IOException ex) {
            Logger.getLogger(Dictionary.class.getName()).log(Level.SEVERE, null, ex);
        }
        return null;
    }

    private String getLine(String root) {
        List<String> lines = this.getAllLines();
        String line;
        for (Iterator<String> itr = lines.iterator(); itr.hasNext();) {
            line = itr.next();
            if (line.split("\\(")[0].equals(root)) {
                return line;
            }
        }
        return null;
    }

    public static void main(String[] args) {
        Margin d = new Margin();
        Dictionary dic = new Dictionary();
        String root = "غلب";
        String line, verb = "غالب";
//        root = dic.getRoot(verb);
        line = d.getLine(root);
        List<String> elements = dic.getLineElements(line);
//        int alph = LocalTime.now().getNano() / 1000000;
////        pl(alph);
//        pl(dic.itemsCount(elements, verb));
//        int beta = LocalTime.now().getNano() / 1000000;
//        pl(beta - alph);

//        line = " غلب(C2(Av(P(غلبت,غلبنا,غلبت,غلبت,غلبتما,غلبتم,غلبتن,غلب,غلبت,غلبا,غلبتا,غلبوا,غلبن),N(أغلب,نغلب,تغلب,تغلبين,تغلبان,تغلبون,تغلبن,يغلب,تغلب,يغلبان,تغلبان,يغلبون,يغلبن),A(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),J(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),E(أغلبن,نغلبن,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,يغلبن,تغلبن,يغلبان,تغلبان,يغلبن,يغلبنان),I(0,0,اغلب,اغلبي,اغلبا,اغلبوا,اغلبن,0,0,0,0,0,0),M(0,0,اغلبن,اغلبن,اغلبان,اغلبن,اغلبنان,0,0,0,0,0,0)),Pv(P(غلبت,غلبنا,غلبت,غلبت,غلبتما,غلبتم,غلبتن,غلب,غلبت,غلبا,غلبتا,غلبوا,غلبن),N(أغلب,نغلب,تغلب,تغلبين,تغلبان,تغلبون,تغلبن,يغلب,تغلب,يغلبان,تغلبان,يغلبون,يغلبن),A(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),J(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),E(أغلبن,نغلبن,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,يغلبن,تغلبن,يغلبان,تغلبان,يغلبن,يغلبنان))),C4(Av(P(غلبت,غلبنا,غلبت,غلبت,غلبتما,غلبتم,غلبتن,غلب,غلبت,غلبا,غلبتا,غلبوا,غلبن),N(أغلب,نغلب,تغلب,تغلبين,تغلبان,تغلبون,تغلبن,يغلب,تغلب,يغلبان,تغلبان,يغلبون,يغلبن),A(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),J(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),E(أغلبن,نغلبن,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,يغلبن,تغلبن,يغلبان,تغلبان,يغلبن,يغلبنان),I(0,0,اغلب,اغلبي,اغلبا,اغلبوا,اغلبن,0,0,0,0,0,0),M(0,0,اغلبن,اغلبن,اغلبان,اغلبن,اغلبنان,0,0,0,0,0,0)),Pv(P(0,0,0,0,0,0,0,غلب,غلبت,0,0,0,0),N(0,0,0,0,0,0,0,يغلب,تغلب,0,0,0,0),A(0,0,0,0,0,0,0,يغلب,تغلب,0,0,0,0),J(0,0,0,0,0,0,0,يغلب,تغلب,0,0,0,0),E(0,0,0,0,0,0,0,يغلبن,تغلبن,0,0,0,0))),C8(Av(P(غلبت,غلبنا,غلبت,غلبت,غلبتما,غلبتم,غلبتن,غلب,غلبت,غلبا,غلبتا,غلبوا,غلبن),N(أغلب,نغلب,تغلب,تغلبين,تغلبان,تغلبون,تغلبن,يغلب,تغلب,يغلبان,تغلبان,يغلبون,يغلبن),A(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),J(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),E(أغلبن,نغلبن,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,يغلبن,تغلبن,يغلبان,تغلبان,يغلبن,يغلبنان),I(0,0,غلب,غلبي,غلبا,غلبوا,غلبن,0,0,0,0,0,0),M(0,0,غلبن,غلبن,غلبان,غلبن,غلبنان,0,0,0,0,0,0)),Pv(P(غلبت,غلبنا,غلبت,غلبت,غلبتما,غلبتم,غلبتن,غلب,غلبت,غلبا,غلبتا,غلبوا,غلبن),N(أغلب,نغلب,تغلب,تغلبين,تغلبان,تغلبون,تغلبن,يغلب,تغلب,يغلبان,تغلبان,يغلبون,يغلبن),A(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),J(أغلب,نغلب,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,يغلب,تغلب,يغلبا,تغلبا,يغلبوا,يغلبن),E(أغلبن,نغلبن,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,يغلبن,تغلبن,يغلبان,تغلبان,يغلبن,يغلبنان))),C9(Av(P(غالبت,غالبنا,غالبت,غالبت,غالبتما,غالبتم,غالبتن,غالب,غالبت,غالبا,غالبتا,غالبوا,غالبن),N(أغالب,نغالب,تغالب,تغالبين,تغالبان,تغالبون,تغالبن,يغالب,تغالب,يغالبان,تغالبان,يغالبون,يغالبن),A(أغالب,نغالب,تغالب,تغالبي,تغالبا,تغالبوا,تغالبن,يغالب,تغالب,يغالبا,تغالبا,يغالبوا,يغالبن),J(أغالب,نغالب,تغالب,تغالبي,تغالبا,تغالبوا,تغالبن,يغالب,تغالب,يغالبا,تغالبا,يغالبوا,يغالبن),E(أغالبن,نغالبن,تغالبن,تغالبن,تغالبان,تغالبن,تغالبنان,يغالبن,تغالبن,يغالبان,تغالبان,يغالبن,يغالبنان),I(0,0,غالب,غالبي,غالبا,غالبوا,غالبن,0,0,0,0,0,0),M(0,0,غالبن,غالبن,غالبان,غالبن,غالبنان,0,0,0,0,0,0)),Pv(P(غولبت,غولبنا,غولبت,غولبت,غولبتما,غولبتم,غولبتن,غولب,غولبت,غولبا,غولبتا,غولبوا,غولبن),N(أغالب,نغالب,تغالب,تغالبين,تغالبان,تغالبون,تغالبن,يغالب,تغالب,يغالبان,تغالبان,يغالبون,يغالبن),A(أغالب,نغالب,تغالب,تغالبي,تغالبا,تغالبوا,تغالبن,يغالب,تغالب,يغالبا,تغالبا,يغالبوا,يغالبن),J(أغالب,نغالب,تغالب,تغالبي,تغالبا,تغالبوا,تغالبن,يغالب,تغالب,يغالبا,تغالبا,يغالبوا,يغالبن),E(أغالبن,نغالبن,تغالبن,تغالبن,تغالبان,تغالبن,تغالبنان,يغالبن,تغالبن,يغالبان,تغالبان,يغالبن,يغالبنان))),C13(Av(P(تغالبت,تغالبنا,تغالبت,تغالبت,تغالبتما,تغالبتم,تغالبتن,تغالب,تغالبت,تغالبا,تغالبتا,تغالبوا,تغالبن),N(أتغالب,نتغالب,تتغالب,تتغالبين,تتغالبان,تتغالبون,تتغالبن,يتغالب,تتغالب,يتغالبان,تتغالبان,يتغالبون,يتغالبن),A(أتغالب,نتغالب,تتغالب,تتغالبي,تتغالبا,تتغالبوا,تتغالبن,يتغالب,تتغالب,يتغالبا,تتغالبا,يتغالبوا,يتغالبن),J(أتغالب,نتغالب,تتغالب,تتغالبي,تتغالبا,تتغالبوا,تتغالبن,يتغالب,تتغالب,يتغالبا,تتغالبا,يتغالبوا,يتغالبن),E(أتغالبن,نتغالبن,تتغالبن,تتغالبن,تتغالبان,تتغالبن,تتغالبنان,يتغالبن,تتغالبن,يتغالبان,تتغالبان,يتغالبن,يتغالبنان),I(0,0,تغالب,تغالبي,تغالبا,تغالبوا,تغالبن,0,0,0,0,0,0),M(0,0,تغالبن,تغالبن,تغالبان,تغالبن,تغالبنان,0,0,0,0,0,0)),Pv(P(0,0,0,0,0,0,0,تغولب,تغولبت,0,0,0,0),N(0,0,0,0,0,0,0,يتغالب,تتغالب,0,0,0,0),A(0,0,0,0,0,0,0,يتغالب,تتغالب,0,0,0,0),J(0,0,0,0,0,0,0,يتغالب,تتغالب,0,0,0,0),E(0,0,0,0,0,0,0,يتغالبن,تتغالبن,0,0,0,0))),C14(Av(P(تغلبت,تغلبنا,تغلبت,تغلبت,تغلبتما,تغلبتم,تغلبتن,تغلب,تغلبت,تغلبا,تغلبتا,تغلبوا,تغلبن),N(أتغلب,نتغلب,تتغلب,تتغلبين,تتغلبان,تتغلبون,تتغلبن,يتغلب,تتغلب,يتغلبان,تتغلبان,يتغلبون,يتغلبن),A(أتغلب,نتغلب,تتغلب,تتغلبي,تتغلبا,تتغلبوا,تتغلبن,يتغلب,تتغلب,يتغلبا,تتغلبا,يتغلبوا,يتغلبن),J(أتغلب,نتغلب,تتغلب,تتغلبي,تتغلبا,تتغلبوا,تتغلبن,يتغلب,تتغلب,يتغلبا,تتغلبا,يتغلبوا,يتغلبن),E(أتغلبن,نتغلبن,تتغلبن,تتغلبن,تتغلبان,تتغلبن,تتغلبنان,يتغلبن,تتغلبن,يتغلبان,تتغلبان,يتغلبن,يتغلبنان),I(0,0,تغلب,تغلبي,تغلبا,تغلبوا,تغلبن,0,0,0,0,0,0),M(0,0,تغلبن,تغلبن,تغلبان,تغلبن,تغلبنان,0,0,0,0,0,0)),Pv(P(0,0,0,0,0,0,0,تغلب,تغلبت,0,0,0,0),N(0,0,0,0,0,0,0,يتغلب,تتغلب,0,0,0,0),A(0,0,0,0,0,0,0,يتغلب,تتغلب,0,0,0,0),J(0,0,0,0,0,0,0,يتغلب,تتغلب,0,0,0,0),E(0,0,0,0,0,0,0,يتغلبن,تتغلبن,0,0,0,0))),C15(Av(P(استغلبت,استغلبنا,استغلبت,استغلبت,استغلبتما,استغلبتم,استغلبتن,استغلب,استغلبت,استغلبا,استغلبتا,استغلبوا,استغلبن),N(أستغلب,نستغلب,تستغلب,تستغلبين,تستغلبان,تستغلبون,تستغلبن,يستغلب,تستغلب,يستغلبان,تستغلبان,يستغلبون,يستغلبن),A(أستغلب,نستغلب,تستغلب,تستغلبي,تستغلبا,تستغلبوا,تستغلبن,يستغلب,تستغلب,يستغلبا,تستغلبا,يستغلبوا,يستغلبن),J(أستغلب,نستغلب,تستغلب,تستغلبي,تستغلبا,تستغلبوا,تستغلبن,يستغلب,تستغلب,يستغلبا,تستغلبا,يستغلبوا,يستغلبن),E(أستغلبن,نستغلبن,تستغلبن,تستغلبن,تستغلبان,تستغلبن,تستغلبنان,يستغلبن,تستغلبن,يستغلبان,تستغلبان,يستغلبن,يستغلبنان),I(0,0,استغلب,استغلبي,استغلبا,استغلبوا,استغلبن,0,0,0,0,0,0),M(0,0,استغلبن,استغلبن,استغلبان,استغلبن,استغلبنان,0,0,0,0,0,0)),Pv(P(0,0,0,0,0,0,0,استغلب,استغلبت,0,0,0,0),N(0,0,0,0,0,0,0,يستغلب,تستغلب,0,0,0,0),A(0,0,0,0,0,0,0,يستغلب,تستغلب,0,0,0,0),J(0,0,0,0,0,0,0,يستغلب,تستغلب,0,0,0,0),E(0,0,0,0,0,0,0,يستغلبن,تستغلبن,0,0,0,0))),C16(Av(P(اغلولبت,اغلولبنا,اغلولبت,اغلولبت,اغلولبتما,اغلولبتم,اغلولبتن,اغلولب,اغلولبت,اغلولبا,اغلولبتا,اغلولبوا,اغلولبن),N(أغلولب,نغلولب,تغلولب,تغلولبين,تغلولبان,تغلولبون,تغلولبن,يغلولب,تغلولب,يغلولبان,تغلولبان,يغلولبون,يغلولبن),A(أغلولب,نغلولب,تغلولب,تغلولبي,تغلولبا,تغلولبوا,تغلولبن,يغلولب,تغلولب,يغلولبا,تغلولبا,يغلولبوا,يغلولبن),J(أغلولب,نغلولب,تغلولب,تغلولبي,تغلولبا,تغلولبوا,تغلولبن,يغلولب,تغلولب,يغلولبا,تغلولبا,يغلولبوا,يغلولبن),E(أغلولبن,نغلولبن,تغلولبن,تغلولبن,تغلولبان,تغلولبن,تغلولبنان,يغلولبن,تغلولبن,يغلولبان,تغلولبان,يغلولبن,يغلولبنان),I(0,0,اغلولب,اغلولبي,اغلولبا,اغلولبوا,اغلولبن,0,0,0,0,0,0),M(0,0,اغلولبن,اغلولبن,اغلولبان,اغلولبن,اغلولبنان,0,0,0,0,0,0)),Pv(P(0,0,0,0,0,0,0,اغلولب,اغلولبت,0,0,0,0),N(0,0,0,0,0,0,0,يغلولب,تغلولب,0,0,0,0),A(0,0,0,0,0,0,0,يغلولب,تغلولب,0,0,0,0),J(0,0,0,0,0,0,0,يغلولب,تغلولب,0,0,0,0),E(0,0,0,0,0,0,0,يغلولبن,تغلولبن,0,0,0,0))))";
//        String[] elements = line.split(",");
        for (String s : elements) {
            pl(s);
        }
    }

    private static void pl(Object o) {
        System.out.println(o);
    }
}
